{
    "posts": [
        {
            "title": "Creating a decentralized bathroom (powered by AT Protocol)",
            "date": "2025-03-08",
            "time": "10:00am EST",
            "author": "Dame",
            "excerpt": "As many of you know by now, I am a Lexicon enjoyer. So much so that this week I created the world's first bathroom that is connected to the AT Protocol. Yes, you read that correctly...",
            "slug": "creating-a-decentralized-bathroom-at-protocol"
        },
        {
            "title": "How I made an automated dynamic avatar for my Bluesky profile",
            "date": "2025-02-05",
            "time": "10:00am EST",
            "author": "Dame",
            "excerpt": "Several years ago, back when Twitter was a thing and it had a decent API, my friend @goose.art did a weird little experiment where he made his avatar dynamic... it automatically changed appearances on a regular basis and became increasingly deep-fried (increased in distortion and lossy compression).",
            "slug": "how-i-made-an-automated-dynamic-avatar-for-my-bluesky-profile"
        },
        {
            "title": "Why I started posting like it’s the 2000s again",
            "date": "2025-01-28",
            "time": "10:00am EST",
            "author": "Dame",
            "excerpt": "In November of 2007, Facebook made a tiny change to its user interface that would massively influence what we know of today as a “post” on social media. What was that change?",
            "slug": "why-i-started-posting-like-its-the-2000s-again"
        },
        {
            "title": "My top 10 moments from 2024",
            "date": "2024-12-31",
            "time": "10:00am EST",
            "author": "Dame",
            "excerpt": "Rhett & Link have a tradition of using their final podcast episode of the year to rank their top 10 moments of the year. These are always some of my favorite episodes of Ear Biscuits, so I thought I should try to do the same thing for myself.",
            "slug": "my-top-10-moments-of-2024"
        },
        {
            "title": "My personal goals for 2025",
            "date": "2024-12-26",
            "time": "10:00am EST",
            "author": "Dame",
            "excerpt": "Yes, I’m a new year goals person... have been most of my life.",
            "slug": "my-personal-goals-for-2025"
        }
    ]
}